package com.company.model;

public class IfElseClass {
    public static void main(String[] args) {

        int a = 15;

        if (a % 2 == 15) { // if(условие true) выполни следующее
            System.out.println( "a = 15" );
        }else // else выполни следующее
            System.out.println( "a != 15" );
        //_____________________________________________________________________________________________________________________________________________________________

        if ((a == 15) && (a < 5)){ // if (условие 1 true (a == 15),и 2 условие false(а < 5)) то при выполнии  при использ лог && (И), 2 условия  ТО оба в том случае если оба true.
            System.out.println("a = 15");
        }else
            System.out.println("a > 15");
        //_____________________________________________________________________________________________________________________________________________________________
    }
}
